app/controllers/courses_controller.rb

  def index
    redirect_guest
    @courses = Course.all
---
SELECT "courses".* FROM "courses"

  def create
    course = Course.create(params[:course])
---
INSERT INTO "courses" ("course_num", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["course_num", "course6"], ["created_at", Sat, 13 Oct 2012 05:30:55 UTC +00:00], ["name", "course6"], ["updated_at", Sat, 13 Oct 2012 05:30:55 UTC +00:00]]