app/controllers/discussions_controller.rb

  def create
    redirect_guest
    @discussion = Discussion.create(:user_id=>current_user.id, :statement=>params[:discussion][:statement])
---
INSERT INTO "discussions" ("created_at", "statement", "topic_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 13 Oct 2012 12:46:20 UTC +00:00], ["statement", "ebc"], ["topic_id", nil], ["updated_at", Sat, 13 Oct 2012 12:46:20 UTC +00:00], ["user_id", 1]]

  def index
    redirect_guest
    @discussions = Discussion.all
---
SELECT "discussions".* FROM "discussions"