app/controllers/problems_controller.rb

INSERT INTO "problems" ("answer", "created_at", "statement", "topic_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["answer", "No"], ["created_at", Sat, 13 Oct 2012 13:23:07 UTC +00:00], ["statement", "Yes?"], ["topic_id", 3], ["updated_at", Sat, 13 Oct 2012 13:23:07 UTC +00:00], ["user_id", 1]]
---
  def create
    redirect_guest
    t_id = params[:topic_id]
    Problem.create(:topic_id => t_id, :statement => params[:problem][:statement], :user_id => current_user.id)

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]
---
  def problems_for_topic
    redirect_guest
    @topic = Topic.find(params[:id])