app/controllers/topics_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def topics_for_course
    redirect_guest
    @course = Course.find(params[:id])

INSERT INTO "topics" ("course_id", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["course_id", 3], ["created_at", Sat, 13 Oct 2012 09:06:02 UTC +00:00], ["name", "sdfdfdfdf"], ["updated_at", Sat, 13 Oct 2012 09:06:02 UTC +00:00]]
---
  def create
    c_id = params[:course_id]
    Topic.create(:course_id => c_id, :name => params[:topic][:name])